{
  "resume": {
    "info": {
      "name": "Christopher Phan",
      "address": "Austin, TX 78754",
      "phone": "(651) 252-1490",
      "email": "c&#104;ris&#64;phan&#46;c&#120;"
    },
    "summary": [
      {
        "item": "Systems Engineering"
      },
      {
        "item": "Development"
      },
      {
        "item": "Technologist"
      },
      {
        "item": "Quality Assurance"
      }
    ],
    "qualifications": [
      {
        "item": "Extensive real-world customer experiences in enterprise architecture and global infrastructures."
      },
      {
        "item": "Creative problem solver with know how to get things done and ability to lead others to success."
      },
      {
        "item": "Excellent interpersonal skills with the ability to develop easy rapport with others while building trust."
      },
      {
        "item": "Success driven, passionate, and committed to excellence, high standards, and customer satisfaction."
      }
    ],
    "experience": [
      {
        "title": "Director of Competitive Intelligence",
        "company": "Tanium",
        "location": "Kirkland, WA",
        "dateFrom": "September 2020",
        "dateTo": "September 2021",
        "work": [
          {
            "item": "Built criteria used by WideNarrow platform to automatically extract news from different sources and transform them into RSS feeds, making it easy for CI team to consume and publish on Google Workspace."
          },
          {
            "item": "Leveraged Microsoft O365 to create a personalized CRM with SMEs and established automatic cadence in order build positioning against competitors."
          },
          {
            "item": "Scripted Google Slide API to automatically generate PPT presentations with updated materials at internal team's request."
          },
          {
            "item": "Built a Power Automate bot to disseminate intelligence over Slack, Microsoft Sharepoint and Teams."
          }
        ]
      },
      {
        "title": "Technical Account Manager",
        "company": "Tanium",
        "location": "Emeryville, CA",
        "dateFrom": "February 2018",
        "dateTo": "September 2020",
        "work": [
          {
            "item": "Pioneered Appliances, cgroups, Mac OS notarization, SAML, BitLocker, Integrity Monitoring, REST token lifecycle with customers, and created documentation on implementation."
          },
          {
            "item": "Interfaced with user experience designers and other developers to ensure thoughtful and coherent user experiences."
          },
          {
            "item": "Tested site in various browsers and devices to ensure cross-browser compatibility and accessibility."
          },
          {
            "item": "Proposed and implemented scalable solutions to issues identified with customers and applications responsible for communicating with Tanium."
          }
        ]
      },
      {
        "title": "Solutions Consultant",
        "company": "Code 42 Software, Inc.",
        "location": "Minneapolis, MN",
        "dateFrom": "March 2015",
        "dateTo": "February 2018",
        "work": [
          {
            "item": "Delivered on SOWs around 5G, IPv6, SCCM, GPO, Munki, NSIS, Casper (JAMF), Meraki, KACE, Ivanti, VMware, AWS, Ansible, Terraform, Jenkins, Symantec."
          },
          {
            "item": "Write modern, performant, and robust code for a diverse array of client and internal projects."
          }
        ]
      },
      {
        "title": "Tier 2 Customer Champion",
        "company": "Code 42 Software, Inc.",
        "location": "Minneapolis, MN",
        "dateFrom": "July 2013",
        "dateTo": "March 2015",
        "work": [
          {
            "item": "Monitored cloud and appliances using observability tools such as Zabbix."
          },
          {
            "item": "Deep log dives using grep, sed, awk to quickly get to RCA."
          }
        ]
      },
      {
        "title": "Technical Lead",
        "company": "IBM",
        "location": "Minneapolis, MN",
        "dateFrom": "May 2012",
        "dateTo": "July 2013",
        "work": [
          {
            "item": "Engineered and maintained major features of Evergreen's CRM using Lotus Notes 8, LotusScript, DB2, SQL, and CSS"
          },
          {
            "item": "Architected and implemented custom front-end to USMT, which lets deskside reps perform account migrations over the network."
          }
        ]
      },
      {
        "title": "Deskside Representative",
        "company": "IBM",
        "location": "Minneapolis, MN",
        "dateFrom": "September 2010",
        "dateTo": "May 2012",
        "work": [
          {
            "item": "Supported Lenovo, Dells, ManageNow, and executives."
          },
          {
            "item": "Completed Install, Move, Add, Change according to RFPs."
          }
        ]
      },
      {
        "title": "Web Developer / Tech Support",
        "company": "University of Minnesota",
        "location": "Minneapolis, MN",
        "dateFrom": "May 2008",
        "dateTo": "September 2010",
        "work": [
          {
            "item": "Work with a variety of different languages, frameworks, and content management systems such as JavaScript, HTML, CSS, PHP, jQuery, CodeIgniter, ASP.NET, SQL, etc."
          },
          {
            "item": "Developed and shipped interactive web application for dormitory walkthrough."
          }
        ]
      }
    ],
    "education": [
      {
        "degree": "110 Credits, Bachelor of Arts, Computer Science",
        "name": "Metropolitan State University",
        "location": "MN",
        "dateFrom": "",
        "dateTo": "In Progress"
      },
      {
        "degree": "100 Credits, Business Management Information Systems",
        "name": "Carlson School of Management",
        "location": "MN",
        "dateFrom": "2007",
        "dateTo": "2010"
      }
    ]
  }
}
